In [1]:
#from a dictionary #values in the list format
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [2]:
import pandas as pd

In [3]:
brics = pd.DataFrame(dict1, index = ['A', 'B', 'C', 'D', 'E'], columns=['country', 'capital'])
brics

        country    capital
A        Brazil   Brasilia
B        Russia     Moscow
C         India  New Delhi
D         China    Beijing
E  South Africa   Pretoria

In [4]:
brics = pd.DataFrame(dict1)
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [5]:
dict2 = {'country': 'South Africa', 'Capital': "Pretoria", "area": 1.221, 'population': 52.98}

In [6]:
x = pd.Series(dict2)
x

country       South Africa
Capital           Pretoria
area                 1.221
population           52.98
dtype: object

In [7]:
dict3  = {0:'Brazil', 1: 'Russia', 2: "India"}
ser = pd.Series(dict3)

In [8]:
#create df from this series
pd.DataFrame(ser, columns=['country'])

  country
0  Brazil
1  Russia
2   India

In [9]:
#create a df from a list of dictionaries
lst = [{"name": "Raj", "Age": 21}, {"name": "Mukul", "Age": 25}, {"name": "Rahul", "Age": 34}]

In [10]:
pd.DataFrame(lst)

   Age   name
0   21    Raj
1   25  Mukul
2   34  Rahul

In [11]:
#create a df from the list of row values
lst_1 = ["Brazil", "Brasilia", 8.516, 200.40]
lst_2= ["SA", "Pretoria", 1.221, 52.98]

In [12]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [13]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [14]:
pd.DataFrame(data = [lst_1, lst_2], columns= ['area', 'capital', 'country', 'population'])

     area   capital  country  population
0  Brazil  Brasilia    8.516      200.40
1      SA  Pretoria    1.221       52.98

In [15]:
#how to work with column names and row indices

In [16]:
brics.columns

Index(['country', 'capital', 'area', 'population'], dtype='object')

In [17]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [18]:
brics.columns = ['co', 'cap', 'ar', 'pop']

In [19]:
brics

             co        cap      ar      pop
0        Brazil   Brasilia   8.516   200.40
1        Russia     Moscow  17.100   143.50
2         India  New Delhi   3.286  1252.00
3         China    Beijing   9.597  1357.00
4  South Africa   Pretoria   1.221    52.98

In [20]:
x = list(brics.columns)

In [21]:
x[2] = "area"

In [22]:
x[0]= "country"

In [23]:
x

['country', 'cap', 'area', 'pop']

In [24]:
x[1]="capital"

In [25]:
brics.columns = x

In [26]:
brics.columns

Index(['country', 'capital', 'area', 'pop'], dtype='object')

In [27]:
a = brics.rename(columns={'pop': 'population'})

In [28]:
brics

        country    capital    area      pop
0        Brazil   Brasilia   8.516   200.40
1        Russia     Moscow  17.100   143.50
2         India  New Delhi   3.286  1252.00
3         China    Beijing   9.597  1357.00
4  South Africa   Pretoria   1.221    52.98

In [29]:
a

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [30]:
brics.rename(columns = {'pop': 'population'}, inplace = True)

In [31]:
brics

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [32]:
brics.rename(mapper = str.upper, axis = "columns", inplace=True )

In [33]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [34]:
brics.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
x = brics.set_index('COUNTRY')

In [36]:
x

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [37]:
x.reset_index(inplace = True)

In [38]:
x

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

---

In [39]:
movies = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv", index_col = 0, na_values = [1, "?", "NA", None] )

In [40]:
movies.head(2)

                    title                                       genres
movieId
NaN      Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
 2.0       Jumanji (1995)                   Adventure|Children|Fantasy

In [41]:
movies = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.csv", index_col = 0, na_values = {'genres': ['?', "NA", "1"]})

In [42]:
movies.head(3)

                           title                                       genres
movieId
1               Toy Story (1995)  Adventure|Animation|Children|Comedy|Fantasy
2                 Jumanji (1995)                   Adventure|Children|Fantasy
3        Grumpier Old Men (1995)                               Comedy|Romance

In [43]:
x = pd.read_excel(r'C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 13 Association Rules Ex 2.xlsx', sheet_name=['Sheet1','ABC'])

In [44]:
x['Sheet1']

,Date,Bill Number,Item Desc,Time,Quantity,Rate,Tax,Discount,Total,Category
0,2010-04-01,G0470115,QUA MINERAL WATER(1000ML),13:15:11,1,50.0,11.88,0.0,61.88,BEVERAGE
1,2010-04-01,G0470115,MONSOON MALABAR (AULAIT),13:15:11,1,100.0,23.75,0.0,123.75,BEVERAGE
2,2010-04-01,G0470116,MASALA CHAI CUTTING,13:17:35,1,40.0,9.50,0.0,49.50,BEVERAGE
3,2010-04-01,G0470117,QUA MINERAL WATER(1000ML),13:19:55,1,50.0,11.88,0.0,61.88,BEVERAGE
4,2010-04-01,G0470283,MOROCCAN MINT TEA,01:20:18,1,45.0,10.69,0.0,55.69,BEVERAGE
5,2010-04-01,G0470283,QUA MINERAL WATER(1000ML),01:20:18,1,50.0,11.88,0.0,61.88,BEVERAGE
6,2010-04-01,G0470118,MASALA CHAI CUTTING,13:21:34,1,40.0,9.50,0.0,49.50,BEVERAGE
7,2010-04-01,G0470118,MOROCCAN MINT TEA,13:21:34,1,45.0,10.69,0.0,55.69,BEVERAGE
8,2010-04-01,G0470284,CAPPUCCINO,01:29:38,1,60.0,14.25,0.0,74.25,BEVERAGE
9,2010-04-01,G0470285,MOROCCAN MINT TEA,01:29:46,1,45.0,10.69,0.0,55.69,BEVERAGE
10,2010-04-01,G0470285,SUMATRA MANDHELING (REG),01:29:46,1,95.0,22.56,0.0,117.56,BEVERAGE
11,2010-04-01,G0470285,BRAZIL BOURBONSANTOS (AULAIT),01:29:46,1,115.0,27.31,0.0,142.31,BEVERAGE
12,2010-04-01,G0470120,LEMON ICED TEA,13:36:33,1,85.0,20.19,0.0,105.19,BEVERAGE
13,2010-04-01,G0470122,COUNTRY LEMONADE,13:42:05,1,85.0,20.19,0.0,105.19,BEVERAGE
14,2010-04-01,G0470122,LEMON ICED TEA,13:42:05,2,85.0,40.38,0.0,210.38,BEVERAGE
15,2010-04-01,G0470127,CAPPUCCINO,14:02:15,1,60.0,14.25,0.0,74.25,BEVERAGE
16,2010-04-01,G0470128,QUA MINERAL WATER(1000ML),14:02:35,1,50.0,11.88,0.0,61.88,BEVERAGE
17,2010-04-01,G0470133,CAPPUCCINO,14:21:32,2,60.0,28.50,0.0,148.50,BEVERAGE
18,2010-04-01,G0470139,QUA MINERAL WATER(1000ML),14:53:24,1,50.0,11.88,0.0,61.88,BEVERAGE
19,2010-04-01,G0470140,MIAMI MELONS,14:54:32,1,85.0,20.19,0.0,105.19,BEVERAGE
20,2010-04-01,G0470141,CAFFE LATTE,15:08:58,1,70.0,16.63,0.0,86.63,BEVERAGE
21,2010-04-01,G0470141,CAPPUCCINO,15:08:58,2,60.0,28.50,0.0,148.50,BEVERAGE
22,2010-04-01,G0470142,COUNTRY LEMONADE,15:09:07,1,85.0,20.19,0.0,105.19,BEVERAGE
23,2010-04-01,G0470145,COUNTRY LEMONADE,15:39:18,1,85.0,20.19,0.0,105.19,BEVERAGE
24,2010-04-01,G0470146,RED BULL ENERGY DRINK,15:48:25,1,125.0,29.69,0.0,154.69,BEVERAGE
25,2010-04-01,G0470148,BRAZIL BOURBONSANTOS (REG),16:06:01,1,95.0,22.56,0.0,117.56,BEVERAGE
26,2010-04-01,G0470149,DOPPIO,16:07:55,1,60.0,14.25,0.0,74.25,BEVERAGE
27,2010-04-01,G0470153,CAFFE LATTE,16:15:45,1,70.0,16.63,0.0,86.63,BEVERAGE
28,2010-04-01,G0470154,PINK LEMONADE,16:15:50,1,85.0,20.19,0.0,105.19,BEVERAGE
29,2010-04-01,G0470156,CAPPUCCINO,16:16:40,1,60.0,14.25,0.0,74.25,BEVERAGE
...,...,...,...,...,...,...,...,...,...,...
145800,2011-02-25,N0033492,WHITE SANGRIA (GLS)áááá áááááá,00:57:01,1,175.0,45.50,0.0,220.50,LIQUOR
145801,2010-04-25,N0028289,WHITE SANGRIA (GLS)áááá áááááá,13:53:17,1,175.0,45.50,0.0,220.50,LIQUOR
145802,2010-05-26,N0028780,WHITE SANGRIA (GLS)áááá áááááá,21:58:31,1,175.0,45.50,0.0,220.50,LIQUOR
145803,2010-11-26,N0031644,WHITE SANGRIA (GLS)áááá áááááá,16:06:25,1,175.0,45.50,0.0,220.50,LIQUOR
145804,2010-12-28,N0032407,WHITE SANGRIA (GLS)áááá áááááá,21:50:35,1,175.0,45.50,0.0,220.50,LIQUOR
145805,2011-01-29,N0033015,WHITE SANGRIA (GLS)áááá áááááá,00:05:32,1,175.0,45.50,0.0,220.50,LIQUOR
145806,2010-05-29,N0028849,WHITE SANGRIA (GLS)áááá áááááá,23:11:29,1,175.0,45.50,0.0,220.50,LIQUOR
145807,2010-09-29,N0030759,WHITE SANGRIA (GLS)áááá áááááá,22:43:23,2,175.0,91.00,0.0,441.00,LIQUOR
145808,2010-11-30,N0031733,WHITE SANGRIA (GLS)áááá áááááá,21:34:54,2,175.0,91.00,0.0,441.00,LIQUOR
145809,2010-12-30,N0032455,WHITE SANGRIA (GLS)áááá áááááá,22:10:50,1,175.0,45.50,0.0,220.50,LIQUOR
145810,2010-07-31,N0029786,WHITE SANGRIA (GLS)áááá áááááá,18:38:26,1,175.0,45.50,0.0,220.50,LIQUOR
145811,2010-06-06,N0028955,ZINZI RED (GLS),20:55:01,1,150.0,39.00,0.0,189.00,LIQUOR
145812,2010-05-16,N0028643,ZINZI RED (GLS),23:12:37,1,150.0,39.00,0.0,189.00,LIQUOR
145813,2010-05-23,N0028741,ZINZI RED (GLS),22:44:29,1,150.0,39.00,0.0,189.00,LIQUOR
145814,2010-05-23,N0028742,ZINZI RED (GLS),22:59:31,1,150.0,39.00,0.0,189.00,LIQUOR
145815,2010-05-24,N0028754,ZINZI RED (GLS),01:08:06,1,150.0,39.00,0.0,189.00,LIQUOR
145816,2010-04-27,N0028347,ZINZI RED (GLS),00:19:00,1,150.0,39.00,0.0,189.00,LIQUOR
145817,2010-05-29,N0028860,ZINZI RED (GLS),01:20:13,1,150.0,39.00,0.0,189.00,LIQUOR
145818,2010-05-29,N0028850,ZINZI RED (GLS),23:12:22,1,150.0,39.00,0.0,189.00,LIQUOR
145819,2010-04-30,N0028399,ZINZI RED (GLS),23:44:37,1,150.0,39.00,0.0,189.00,LIQUOR
145820,2010-06-08,N0028991,ZINZI WHITE (GLS),01:09:11,2,150.0,78.00,0.0,378.00,LIQUOR
145821,2010-06-08,N0028977,ZINZI WHITE (GLS),10:41:38,1,150.0,39.00,0.0,189.00,LIQUOR
145822,2010-06-10,N0029010,ZINZI WHITE (GLS),01:00:53,2,150.0,78.00,0.0,378.00,LIQUOR
145823,2010-05-18,N0028656,ZINZI WHITE (GLS),16:52:21,1,150.0,39.00,0.0,189.00,LIQUOR
145824,2010-05-19,N0028669,ZINZI WHITE (GLS),17:06:10,1,150.0,39.00,0.0,189.00,LIQUOR
145825,2010-05-22,N0028716,ZINZI WHITE (GLS),21:43:55,2,150.0,78.00,0.0,378.00,LIQUOR
145826,2010-04-27,N0028343,ZINZI WHITE (GLS),20:52:11,2,150.0,78.00,0.0,378.00,LIQUOR
145827,2010-05-28,N0028835,ZINZI WHITE (GLS),01:03:37,3,150.0,117.00,0.0,567.00,LIQUOR
145828,2010-04-30,N0028399,ZINZI WHITE (GLS),23:44:37,1,150.0,39.00,0.0,189.00,LIQUOR
145829,2010-07-09,N0029472,ZINZI WHITE (BTL),00:31:51,1,700.0,182.00,0.0,882.00,LIQUOR

In [45]:
x['ABC']

   Unnamed: 0 Unnamed: 1
0         NaN        NaN
1         NaN          s
2         3.0          4

In [46]:
import warnings
warnings.filterwarnings(action = 'ignore')

In [47]:
movies = pd.read_table(r"C:\Users\Vaibhav\Desktop\BA\Datasets\movies.dat", sep = "::", names = ["MovieID", "Title", "Genres"] )

In [48]:
movies.head(3)

   MovieID                    Title                        Genres
0        1         Toy Story (1995)   Animation|Children's|Comedy
1        2           Jumanji (1995)  Adventure|Children's|Fantasy
2        3  Grumpier Old Men (1995)                Comedy|Romance

In [49]:
from sklearn import datasets
import numpy as np

In [50]:
bs = datasets.load_boston()

In [51]:
bs

{'data': array([[6.3200e-03, 1.8000e+01, 2.3100e+00, ..., 1.5300e+01, 3.9690e+02,
         4.9800e+00],
        [2.7310e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9690e+02,
         9.1400e+00],
        [2.7290e-02, 0.0000e+00, 7.0700e+00, ..., 1.7800e+01, 3.9283e+02,
         4.0300e+00],
        ...,
        [6.0760e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         5.6400e+00],
        [1.0959e-01, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9345e+02,
         6.4800e+00],
        [4.7410e-02, 0.0000e+00, 1.1930e+01, ..., 2.1000e+01, 3.9690e+02,
         7.8800e+00]]),
 'target': array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
        18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2, 13.6, 19.6,
        15.2, 14.5, 15.6, 13.9, 16.6, 14.8, 18.4, 21. , 12.7, 14.5, 13.2,
        13.1, 13.5, 18.9, 20. , 21. , 24.7, 30.8, 34.9, 26.6, 25.3, 24.7,
        21.2, 19.3, 20. , 16.6, 14.4, 19.4, 19.7, 20.5, 25. , 23.4, 18.9,
        35.4, 24.7, 31.6, 23.3, 19.6, 18.7, 16. , 22.2, 25. , 33. , 23.5,
        19.4, 22. , 17.4, 20.9, 24.2, 21.7, 22.8, 23.4, 24.1, 21.4, 20. ,
        20.8, 21.2, 20.3, 28. , 23.9, 24.8, 22.9, 23.9, 26.6, 22.5, 22.2,
        23.6, 28.7, 22.6, 22. , 22.9, 25. , 20.6, 28.4, 21.4, 38.7, 43.8,
        33.2, 27.5, 26.5, 18.6, 19.3, 20.1, 19.5, 19.5, 20.4, 19.8, 19.4,
        21.7, 22.8, 18.8, 18.7, 18.5, 18.3, 21.2, 19.2, 20.4, 19.3, 22. ,
        20.3, 20.5, 17.3, 18.8, 21.4, 15.7, 16.2, 18. , 14.3, 19.2, 19.6,
        23. , 18.4, 15.6, 18.1, 17.4, 17.1, 13.3, 17.8, 14. , 14.4, 13.4,
        15.6, 11.8, 13.8, 15.6, 14.6, 17.8, 15.4, 21.5, 19.6, 15.3, 19.4,
        17. , 15.6, 13.1, 41.3, 24.3, 23.3, 27. , 50. , 50. , 50. , 22.7,
        25. , 50. , 23.8, 23.8, 22.3, 17.4, 19.1, 23.1, 23.6, 22.6, 29.4,
        23.2, 24.6, 29.9, 37.2, 39.8, 36.2, 37.9, 32.5, 26.4, 29.6, 50. ,
        32. , 29.8, 34.9, 37. , 30.5, 36.4, 31.1, 29.1, 50. , 33.3, 30.3,
        34.6, 34.9, 32.9, 24.1, 42.3, 48.5, 50. , 22.6, 24.4, 22.5, 24.4,
        20. , 21.7, 19.3, 22.4, 28.1, 23.7, 25. , 23.3, 28.7, 21.5, 23. ,
        26.7, 21.7, 27.5, 30.1, 44.8, 50. , 37.6, 31.6, 46.7, 31.5, 24.3,
        31.7, 41.7, 48.3, 29. , 24. , 25.1, 31.5, 23.7, 23.3, 22. , 20.1,
        22.2, 23.7, 17.6, 18.5, 24.3, 20.5, 24.5, 26.2, 24.4, 24.8, 29.6,
        42.8, 21.9, 20.9, 44. , 50. , 36. , 30.1, 33.8, 43.1, 48.8, 31. ,
        36.5, 22.8, 30.7, 50. , 43.5, 20.7, 21.1, 25.2, 24.4, 35.2, 32.4,
        32. , 33.2, 33.1, 29.1, 35.1, 45.4, 35.4, 46. , 50. , 32.2, 22. ,
        20.1, 23.2, 22.3, 24.8, 28.5, 37.3, 27.9, 23.9, 21.7, 28.6, 27.1,
        20.3, 22.5, 29. , 24.8, 22. , 26.4, 33.1, 36.1, 28.4, 33.4, 28.2,
        22.8, 20.3, 16.1, 22.1, 19.4, 21.6, 23.8, 16.2, 17.8, 19.8, 23.1,
        21. , 23.8, 23.1, 20.4, 18.5, 25. , 24.6, 23. , 22.2, 19.3, 22.6,
        19.8, 17.1, 19.4, 22.2, 20.7, 21.1, 19.5, 18.5, 20.6, 19. , 18.7,
        32.7, 16.5, 23.9, 31.2, 17.5, 17.2, 23.1, 24.5, 26.6, 22.9, 24.1,
        18.6, 30.1, 18.2, 20.6, 17.8, 21.7, 22.7, 22.6, 25. , 19.9, 20.8,
        16.8, 21.9, 27.5, 21.9, 23.1, 50. , 50. , 50. , 50. , 50. , 13.8,
        13.8, 15. , 13.9, 13.3, 13.1, 10.2, 10.4, 10.9, 11.3, 12.3,  8.8,
         7.2, 10.5,  7.4, 10.2, 11.5, 15.1, 23.2,  9.7, 13.8, 12.7, 13.1,
        12.5,  8.5,  5. ,  6.3,  5.6,  7.2, 12.1,  8.3,  8.5,  5. , 11.9,
        27.9, 17.2, 27.5, 15. , 17.2, 17.9, 16.3,  7. ,  7.2,  7.5, 10.4,
         8.8,  8.4, 16.7, 14.2, 20.8, 13.4, 11.7,  8.3, 10.2, 10.9, 11. ,
         9.5, 14.5, 14.1, 16.1, 14.3, 11.7, 13.4,  9.6,  8.7,  8.4, 12.8,
        10.5, 17.1, 18.4, 15.4, 10.8, 11.8, 14.9, 12.6, 14.1, 13. , 13.4,
        15.2, 16.1, 17.8, 14.9, 14.1, 12.7, 13.5, 14.9, 20. , 16.4, 17.7,
        19.5, 20.2, 21.4, 19.9, 19. , 19.1, 19.1, 20.1, 19.9, 19.6, 23.2,
        29.8, 13.8, 13.3, 16.7, 12. , 14.6, 21.4, 23. , 23.7, 25. , 21.8,
        20.6, 21.2, 19.1, 20.6, 15.2,  7. ,  8.1, 13.6, 20.1, 21.8, 24.5,
        23.1, 19.7, 18.3, 21.2, 17.5, 16.8, 22.4, 20.6, 23.9, 22. , 11.9]),
 'feature_names': array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
        'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7'),
 'DESCR': "Boston House Prices dataset\n===========================\n\nNotes\n------\nData Set Characteristics:  \n\n    :Number of Instances: 506 \n\n    :Number of Attributes: 13 numeric/categorical predictive\n    \n    :Median Value (attribute 14) is usually the target\n\n    :Attribute Information (in order):\n        - CRIM     per capita crime rate by town\n        - ZN       proportion of residential land zoned for lots over 25,000 sq.ft.\n        - INDUS    proportion of non-retail business acres per town\n        - CHAS     Charles River dummy variable (= 1 if tract bounds river; 0 otherwise)\n        - NOX      nitric oxides concentration (parts per 10 million)\n        - RM       average number of rooms per dwelling\n        - AGE      proportion of owner-occupied units built prior to 1940\n        - DIS      weighted distances to five Boston employment centres\n        - RAD      index of accessibility to radial highways\n        - TAX      full-value property-tax rate per $10,000\n        - PTRATIO  pupil-teacher ratio by town\n        - B        1000(Bk - 0.63)^2 where Bk is the proportion of blacks by town\n        - LSTAT    % lower status of the population\n        - MEDV     Median value of owner-occupied homes in $1000's\n\n    :Missing Attribute Values: None\n\n    :Creator: Harrison, D. and Rubinfeld, D.L.\n\nThis is a copy of UCI ML housing dataset.\nhttp://archive.ics.uci.edu/ml/datasets/Housing\n\n\nThis dataset was taken from the StatLib library which is maintained at Carnegie Mellon University.\n\nThe Boston house-price data of Harrison, D. and Rubinfeld, D.L. 'Hedonic\nprices and the demand for clean air', J. Environ. Economics & Management,\nvol.5, 81-102, 1978.   Used in Belsley, Kuh & Welsch, 'Regression diagnostics\n...', Wiley, 1980.   N.B. Various transformations are used in the table on\npages 244-261 of the latter.\n\nThe Boston house-price data has been used in many machine learning papers that address regression\nproblems.   \n     \n**References**\n\n   - Belsley, Kuh & Welsch, 'Regression diagnostics: Identifying Influential Data and Sources of Collinearity', Wiley, 1980. 244-261.\n   - Quinlan,R. (1993). Combining Instance-Based and Model-Based Learning. In Proceedings on the Tenth International Conference of Machine Learning, 236-243, University of Massachusetts, Amherst. Morgan Kaufmann.\n   - many more! (see http://archive.ics.uci.edu/ml/datasets/Housing)\n"}

In [52]:
X = bs.data #values for all the IVs
X[0]

array([6.320e-03, 1.800e+01, 2.310e+00, 0.000e+00, 5.380e-01, 6.575e+00,
       6.520e+01, 4.090e+00, 1.000e+00, 2.960e+02, 1.530e+01, 3.969e+02,
       4.980e+00])

In [53]:
X.shape

(506, 13)

In [54]:
y = bs.target # y values
y[:20]

array([24. , 21.6, 34.7, 33.4, 36.2, 28.7, 22.9, 27.1, 16.5, 18.9, 15. ,
       18.9, 21.7, 20.4, 18.2, 19.9, 23.1, 17.5, 20.2, 18.2])

In [55]:
y.shape

(506,)

In [56]:
bs.feature_names

array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7')

In [57]:
import numpy as np

In [58]:
p = np.c_[y, X]

In [59]:
p.shape

(506, 14)

In [60]:
p[0]

array([2.400e+01, 6.320e-03, 1.800e+01, 2.310e+00, 0.000e+00, 5.380e-01,
       6.575e+00, 6.520e+01, 4.090e+00, 1.000e+00, 2.960e+02, 1.530e+01,
       3.969e+02, 4.980e+00])

In [61]:
bs.feature_names

array(['CRIM', 'ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD',
       'TAX', 'PTRATIO', 'B', 'LSTAT'], dtype='<U7')

In [62]:
col= ['medv'] + list(bs.feature_names)

In [63]:
col

['medv',
 'CRIM',
 'ZN',
 'INDUS',
 'CHAS',
 'NOX',
 'RM',
 'AGE',
 'DIS',
 'RAD',
 'TAX',
 'PTRATIO',
 'B',
 'LSTAT']

In [64]:
bosdf = pd.DataFrame(p, columns= col)

In [65]:
bosdf.head(3)

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

---

In [66]:
iris = datasets.load_iris()

In [67]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [68]:
X = iris.data

In [69]:
y = iris.target

In [70]:
X.shape, y.shape

((150, 4), (150,))

In [71]:
print(X[0])

[5.1 3.5 1.4 0.2]

In [72]:
print(y)

[0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
 0 0 0 0 0 0 0 0 0 0 0 0 0 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1
 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 1 2 2 2 2 2 2 2 2 2 2 2
 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2 2
 2 2]

In [73]:
iris.feature_names

['sepal length (cm)',
 'sepal width (cm)',
 'petal length (cm)',
 'petal width (cm)']

In [74]:
iris.DESCR

'Iris Plants Database\n====================\n\nNotes\n-----\nData Set Characteristics:\n    :Number of Instances: 150 (50 in each of three classes)\n    :Number of Attributes: 4 numeric, predictive attributes and the class\n    :Attribute Information:\n        - sepal length in cm\n        - sepal width in cm\n        - petal length in cm\n        - petal width in cm\n        - class:\n                - Iris-Setosa\n                - Iris-Versicolour\n                - Iris-Virginica\n    :Summary Statistics:\n\n    ============== ==== ==== ======= ===== ====================\n                    Min  Max   Mean    SD   Class Correlation\n    ============== ==== ==== ======= ===== ====================\n    sepal length:   4.3  7.9   5.84   0.83    0.7826\n    sepal width:    2.0  4.4   3.05   0.43   -0.4194\n    petal length:   1.0  6.9   3.76   1.76    0.9490  (high!)\n    petal width:    0.1  2.5   1.20  0.76     0.9565  (high!)\n    ============== ==== ==== ======= ===== ====================\n\n    :Missing Attribute Values: None\n    :Class Distribution: 33.3% for each of 3 classes.\n    :Creator: R.A. Fisher\n    :Donor: Michael Marshall (MARSHALL%PLU@io.arc.nasa.gov)\n    :Date: July, 1988\n\nThis is a copy of UCI ML iris datasets.\nhttp://archive.ics.uci.edu/ml/datasets/Iris\n\nThe famous Iris database, first used by Sir R.A Fisher\n\nThis is perhaps the best known database to be found in the\npattern recognition literature.  Fisher\'s paper is a classic in the field and\nis referenced frequently to this day.  (See Duda & Hart, for example.)  The\ndata set contains 3 classes of 50 instances each, where each class refers to a\ntype of iris plant.  One class is linearly separable from the other 2; the\nlatter are NOT linearly separable from each other.\n\nReferences\n----------\n   - Fisher,R.A. "The use of multiple measurements in taxonomic problems"\n     Annual Eugenics, 7, Part II, 179-188 (1936); also in "Contributions to\n     Mathematical Statistics" (John Wiley, NY, 1950).\n   - Duda,R.O., & Hart,P.E. (1973) Pattern Classification and Scene Analysis.\n     (Q327.D83) John Wiley & Sons.  ISBN 0-471-22361-1.  See page 218.\n   - Dasarathy, B.V. (1980) "Nosing Around the Neighborhood: A New System\n     Structure and Classification Rule for Recognition in Partially Exposed\n     Environments".  IEEE Transactions on Pattern Analysis and Machine\n     Intelligence, Vol. PAMI-2, No. 1, 67-71.\n   - Gates, G.W. (1972) "The Reduced Nearest Neighbor Rule".  IEEE Transactions\n     on Information Theory, May 1972, 431-433.\n   - See also: 1988 MLC Proceedings, 54-64.  Cheeseman et al"s AUTOCLASS II\n     conceptual clustering system finds 3 classes in the data.\n   - Many, many more ...\n'

In [75]:
iris.target_names

array(['setosa', 'versicolor', 'virginica'], dtype='<U10')

In [76]:
y.shape, X.shape

((150,), (150, 4))

In [77]:
ir = np.c_[y, X]

In [78]:
ir.shape

(150, 5)

In [79]:
ir[:,0]

array([0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0.,
       0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1.,
       1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 1., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.,
       2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2., 2.])

In [80]:
x = pd.DataFrame(ir, columns=['Species']+list(iris.feature_names))

In [81]:
x.head(3)

,Species,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
0,0.0,5.1,3.5,1.4,0.2
1,0.0,4.9,3.0,1.4,0.2
2,0.0,4.7,3.2,1.3,0.2

In [82]:
x.to_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\iris.csv")

In [83]:
hyp = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\Lesson 8-9 Hypothesis Testing Ex 1.csv")

In [84]:
hyp.head(3)

    ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70       0     4    1       1     1    57     52     41     47   57
1  121       1     4    2       1     3    68     59     53     63   61
2   86       0     4    3       1     1    44     33     54     58   31

In [85]:
hyp.tail(3)

      ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
197  187       1     4    2       2     1    57     41     57     55   52
198  118       1     4    2       1     1    55     62     58     58   61
199  137       1     4    3       1     2    63     65     65     53   61

In [86]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
ID        200 non-null int64
Gender    200 non-null int64
Race      200 non-null int64
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: int64(11)
memory usage: 17.3 KB

### Slicing dataframes

In [87]:
hyp.Gender = hyp.Gender.astype(np.bool)

In [88]:
x = hyp['Gender']

In [89]:
x.dtype

dtype('bool')

In [90]:
type(x)

pandas.core.series.Series

In [91]:
x.shape

(200,)

In [92]:
y = hyp[['Gender']]
y.shape

(200, 1)

In [93]:
type(y)

pandas.core.frame.DataFrame

In [94]:
hyp[:3]

    ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70   False     4    1       1     1    57     52     41     47   57
1  121    True     4    2       1     3    68     59     53     63   61
2   86   False     4    3       1     1    44     33     54     58   31

In [95]:
brics[:3]

  COUNTRY    CAPITAL    AREA  POPULATION
0  Brazil   Brasilia   8.516       200.4
1  Russia     Moscow  17.100       143.5
2   India  New Delhi   3.286      1252.0

In [96]:
brics['COUNTRY']

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: COUNTRY, dtype: object

In [97]:
brics.COUNTRY #will also return a series

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: COUNTRY, dtype: object

In [98]:
brics[['COUNTRY']]

        COUNTRY
0        Brazil
1        Russia
2         India
3         China
4  South Africa

In [99]:
brics[['COUNTRY', 'AREA']]

        COUNTRY    AREA
0        Brazil   8.516
1        Russia  17.100
2         India   3.286
3         China   9.597
4  South Africa   1.221

In [100]:
brics[[True, False, True, False, True]]

        COUNTRY    CAPITAL   AREA  POPULATION
0        Brazil   Brasilia  8.516      200.40
2         India  New Delhi  3.286     1252.00
4  South Africa   Pretoria  1.221       52.98

In [101]:
np.logical_and(brics.CAPITAL=="New Delhi", brics.AREA<10)

0    False
1    False
2     True
3    False
4    False
Name: CAPITAL, dtype: bool

In [102]:
brics[np.logical_and(brics.CAPITAL=="New Delhi", brics.AREA<10)]

  COUNTRY    CAPITAL   AREA  POPULATION
2   India  New Delhi  3.286      1252.0

In [103]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [104]:
brics.loc[[0,1,2], ['COUNTRY', 'AREA']]

  COUNTRY    AREA
0  Brazil   8.516
1  Russia  17.100
2   India   3.286

In [105]:
brics.set_index('COUNTRY', inplace = True)

In [106]:
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [107]:
brics.loc[['China', 'India'], ['POPULATION']]

         POPULATION
COUNTRY
China        1357.0
India        1252.0

In [108]:
brics.loc['India', ['POPULATION']]

POPULATION    1252
Name: India, dtype: object

In [109]:
brics.loc[:, 'POPULATION']

COUNTRY
Brazil           200.40
Russia           143.50
India           1252.00
China           1357.00
South Africa      52.98
Name: POPULATION, dtype: float64

In [110]:
brics.loc['Brazil': 'China': 2 , 'AREA':]

          AREA  POPULATION
COUNTRY
Brazil   8.516       200.4
India    3.286      1252.0

In [111]:
brics.loc[[True, False, True, False, True], [True, False, True]]

                CAPITAL  POPULATION
COUNTRY
Brazil         Brasilia      200.40
India         New Delhi     1252.00
South Africa   Pretoria       52.98

In [112]:
brics.loc[brics.CAPITAL == "New Delhi", ['AREA']]

          AREA
COUNTRY
India    3.286

In [113]:
brics.CAPITAL

COUNTRY
Brazil           Brasilia
Russia             Moscow
India           New Delhi
China             Beijing
South Africa     Pretoria
Name: CAPITAL, dtype: object

In [114]:
brics.CAPITAL.isin(['Moscow', 'Beijing'])

COUNTRY
Brazil          False
Russia           True
India           False
China            True
South Africa    False
Name: CAPITAL, dtype: bool

In [115]:
brics.loc[brics.CAPITAL.isin(['Moscow', 'Beijing']), brics.columns.isin(['CAPITAL', 'AREA'])]

         CAPITAL    AREA
COUNTRY
Russia    Moscow  17.100
China    Beijing   9.597

In [116]:
brics.columns.isin(['CAPITAL', 'AREA'])

array([ True,  True, False])

In [117]:
bosdf.head(3)

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
0,24.0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98
1,21.6,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14
2,34.7,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03

In [118]:
bosdf.loc[14:10:-1,: ]

,medv,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT
14,18.2,0.63796,0.0,8.14,0.0,0.538,6.096,84.5,4.4619,4.0,307.0,21.0,380.02,10.26
13,20.4,0.62976,0.0,8.14,0.0,0.538,5.949,61.8,4.7075,4.0,307.0,21.0,396.90,8.26
12,21.7,0.09378,12.5,7.87,0.0,0.524,5.889,39.0,5.4509,5.0,311.0,15.2,390.50,15.71
11,18.9,0.11747,12.5,7.87,0.0,0.524,6.009,82.9,6.2267,5.0,311.0,15.2,396.90,13.27
10,15.0,0.22489,12.5,7.87,0.0,0.524,6.377,94.3,6.3467,5.0,311.0,15.2,392.52,20.45

### iloc function

In [119]:
brics.iloc[:3, [2, 0]]

         POPULATION    CAPITAL
COUNTRY
Brazil        200.4   Brasilia
Russia        143.5     Moscow
India        1252.0  New Delhi

In [120]:
#using iloc and loc commands we can change the positions of the columns

In [121]:
brics.iloc[[1]]

        CAPITAL  AREA  POPULATION
COUNTRY
Russia   Moscow  17.1       143.5

In [122]:
brics.iloc[:, brics.columns.isin(['CAPITAL', 'a'])]

                CAPITAL
COUNTRY
Brazil         Brasilia
Russia           Moscow
India         New Delhi
China           Beijing
South Africa   Pretoria

In [123]:
brics.CAPITAL=='New Delhi'

COUNTRY
Brazil          False
Russia          False
India            True
China           False
South Africa    False
Name: CAPITAL, dtype: bool

In [124]:
brics.loc[brics.CAPITAL=='New Delhi']

           CAPITAL   AREA  POPULATION
COUNTRY
India    New Delhi  3.286      1252.0

In [125]:
brics.iloc[[0,1,2], [0,2]]

           CAPITAL  POPULATION
COUNTRY
Brazil    Brasilia       200.4
Russia      Moscow       143.5
India    New Delhi      1252.0

---

In [126]:
### Statistical fns

In [127]:
hyp.head(3)

    ID  Gender  Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70   False     4    1       1     1    57     52     41     47   57
1  121    True     4    2       1     3    68     59     53     63   61
2   86   False     4    3       1     1    44     33     54     58   31

In [128]:
hyp.mean()

ID        100.500
Gender      0.545
Race        3.430
SEB         2.055
School      1.160
Prog        2.025
Read       52.230
Write      52.775
Math1      52.645
Math2      51.850
SST        52.405
dtype: float64

In [129]:
hyp.mean(axis = 0)

ID        100.500
Gender      0.545
Race        3.430
SEB         2.055
School      1.160
Prog        2.025
Read       52.230
Write      52.775
Math1      52.645
Math2      51.850
SST        52.405
dtype: float64

In [130]:
hyp.mean(axis=0, skipna  = True) #skip the nas and find the mean

ID        100.500
Gender      0.545
Race        3.430
SEB         2.055
School      1.160
Prog        2.025
Read       52.230
Write      52.775
Math1      52.645
Math2      51.850
SST        52.405
dtype: float64

In [131]:
#mean, median, std, min, max, argmin, argmax

In [132]:
hyp['Math1'].quantile(q = .99,)

73.01999999999998

In [133]:
hyp["Math1"].var()

87.76781407035176

In [134]:
np.where(hyp.Math1>73.01)

(array([21, 36], dtype=int64),)

----

### SUMMARY FUNCTIONS

In [135]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
ID        200 non-null int64
Gender    200 non-null bool
Race      200 non-null int64
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null int64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: bool(1), int64(10)
memory usage: 15.9 KB

In [136]:
hyp.dtypes

ID        int64
Gender     bool
Race      int64
SEB       int64
School    int64
Prog      int64
Read      int64
Write     int64
Math1     int64
Math2     int64
SST       int64
dtype: object

In [137]:
hyp.Read=hyp['Read'].astype(np.float64)

In [138]:
hyp.Read.dtype

dtype('float64')

In [139]:
hyp.describe()

,ID,Race,SEB,School,Prog,Read,Write,Math1,Math2,SST
count,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
mean,100.500000,3.430000,2.055000,1.160000,2.025000,52.230000,52.775000,52.645000,51.850000,52.405000
std,57.879185,1.039472,0.724291,0.367526,0.690477,10.252937,9.478586,9.368448,9.900891,10.735793
min,1.000000,1.000000,1.000000,1.000000,1.000000,28.000000,31.000000,33.000000,26.000000,26.000000
25%,50.750000,3.000000,2.000000,1.000000,2.000000,44.000000,45.750000,45.000000,44.000000,46.000000
50%,100.500000,4.000000,2.000000,1.000000,2.000000,50.000000,54.000000,52.000000,53.000000,52.000000
75%,150.250000,4.000000,3.000000,1.000000,2.250000,60.000000,60.000000,59.000000,58.000000,61.000000
max,200.000000,4.000000,3.000000,2.000000,3.000000,76.000000,67.000000,75.000000,74.000000,71.000000

In [140]:
hyp.Gender.dtype

dtype('bool')

In [141]:
hyp.describe(include = "all")

,ID,Gender,Race,SEB,School,Prog,Read,Write,Math1,Math2,SST
count,200.000000,200,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000,200.000000
unique,NaN,2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,True,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,109,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,100.500000,NaN,3.430000,2.055000,1.160000,2.025000,52.230000,52.775000,52.645000,51.850000,52.405000
std,57.879185,NaN,1.039472,0.724291,0.367526,0.690477,10.252937,9.478586,9.368448,9.900891,10.735793
min,1.000000,NaN,1.000000,1.000000,1.000000,1.000000,28.000000,31.000000,33.000000,26.000000,26.000000
25%,50.750000,NaN,3.000000,2.000000,1.000000,2.000000,44.000000,45.750000,45.000000,44.000000,46.000000
50%,100.500000,NaN,4.000000,2.000000,1.000000,2.000000,50.000000,54.000000,52.000000,53.000000,52.000000
75%,150.250000,NaN,4.000000,3.000000,1.000000,2.250000,60.000000,60.000000,59.000000,58.000000,61.000000
max,200.000000,NaN,4.000000,3.000000,2.000000,3.000000,76.000000,67.000000,75.000000,74.000000,71.000000

In [142]:
#freq distribution of a uni-variate categorical variable
pd.value_counts(hyp.Gender, dropna = True)

True     109
False     91
Name: Gender, dtype: int64

In [143]:
hyp.Race.value_counts(dropna=False)

4    145
1     24
3     20
2     11
Name: Race, dtype: int64

In [144]:
hyp.Race = hyp.Race.astype('category')

In [145]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
ID        200 non-null int64
Gender    200 non-null bool
Race      200 non-null category
SEB       200 non-null int64
School    200 non-null int64
Prog      200 non-null int64
Read      200 non-null float64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: bool(1), category(1), float64(1), int64(8)
memory usage: 14.7 KB

In [146]:
hyp.head(3)

    ID  Gender Race  SEB  School  Prog  Read  Write  Math1  Math2  SST
0   70   False    4    1       1     1  57.0     52     41     47   57
1  121    True    4    2       1     3  68.0     59     53     63   61
2   86   False    4    3       1     1  44.0     33     54     58   31

In [147]:
categorical = list(hyp.columns)[1:6]
categorical

['Gender', 'Race', 'SEB', 'School', 'Prog']

In [148]:
for col in categorical:
    hyp[col] = hyp[col].astype('category')

In [149]:
hyp.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 11 columns):
ID        200 non-null int64
Gender    200 non-null category
Race      200 non-null category
SEB       200 non-null category
School    200 non-null category
Prog      200 non-null category
Read      200 non-null float64
Write     200 non-null int64
Math1     200 non-null int64
Math2     200 non-null int64
SST       200 non-null int64
dtypes: category(5), float64(1), int64(5)
memory usage: 11.0 KB

In [150]:
np.unique(hyp.Race)

array([1, 2, 3, 4], dtype=int64)

In [151]:
pd.crosstab(index = hyp["Gender"], columns=hyp["Race"])

Race     1  2   3   4
Gender
False   13  3   7  68
True    11  8  13  77

In [152]:
#mean marks in Math1 according to gender and according to race

In [153]:
hyp.pivot_table(index = "Gender", columns="Race", values = "Math1", aggfunc= lambda x: np.mean(x))

Race            1          2          3          4
Gender
False   49.230769  58.666667  45.285714  54.191176
True    45.272727  56.750000  47.538462  53.779221

In [154]:
matches = pd.read_csv(r"C:\Users\Vaibhav\Desktop\BA\Datasets\matches.csv")

In [155]:
matches.head(3)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,05/04/17,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,06/04/17,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN

In [156]:
pd.value_counts(matches.toss_decision)

field    363
bat      273
Name: toss_decision, dtype: int64

In [157]:
pd.unique(matches.toss_decision)

array(['field', 'bat'], dtype=object)

In [158]:
grouped = matches.groupby("toss_decision")

In [159]:
grouped

In [160]:
fld = grouped.get_group('field')

In [161]:
bat = grouped.get_group('bat')

In [162]:
bat.head(3)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
4,5,2017,Bangalore,08/04/17,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN
7,8,2017,Indore,10/04/17,Royal Challengers Bangalore,Kings XI Punjab,Royal Challengers Bangalore,bat,normal,0,Kings XI Punjab,0,8,AR Patel,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN
14,15,2017,Delhi,15/04/17,Delhi Daredevils,Kings XI Punjab,Delhi Daredevils,bat,normal,0,Delhi Daredevils,51,0,CJ Anderson,Feroz Shah Kotla,YC Barde,Nitin Menon,NaN

In [163]:
grouped.win_by_runs.mean()

toss_decision
bat      13.117216
field    14.107438
Name: win_by_runs, dtype: float64

In [164]:
grouped.count()

,id,season,city,date,team1,team2,toss_winner,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
toss_decision,,,,,,,,,,,,,,,,,
bat,273,273,270,273,273,273,273,273,273,272,273,273,272,273,272,272,0
field,363,363,359,363,363,363,363,363,363,361,363,363,361,363,363,363,0

In [165]:
grouped.mean()

,id,season,dl_applied,win_by_runs,win_by_wickets,umpire3
toss_decision,,,,,,
bat,306.769231,2011.798535,0.021978,13.117216,3.36630,NaN
field,327.322314,2013.011019,0.027548,14.107438,3.37741,NaN

In [166]:
grouped[['season', 'win_by_runs']].median()

               season  win_by_runs
toss_decision
bat              2012            0
field            2013            0

In [167]:
grouped.agg(['sum', np.mean])

                   id              season              dl_applied            \
                  sum        mean     sum         mean        sum      mean
toss_decision
bat             83748  306.769231  549221  2011.798535          6  0.021978
field          118818  327.322314  730723  2013.011019         10  0.027548

              win_by_runs            win_by_wickets          umpire3
                      sum       mean            sum     mean     sum mean
toss_decision
bat                  3581  13.117216            919  3.36630     0.0  NaN
field                5121  14.107438           1226  3.37741     0.0  NaN

In [168]:
#different aggregation fn for diff column and the aggregation fn can also be custom defined

In [169]:
def data_range(series):
    return series.max() - series.min()

In [170]:
grouped.agg(data_range)

                id  season  dl_applied  win_by_runs  win_by_wickets  umpire3
toss_decision
bat            631       9           1          111              10      NaN
field          634       9           1          146              10      NaN

In [171]:
aggregations = {
                'season': {'Season_Mean': np.mean},
                'win_by_runs': {'Max_winbyruns': np.max, 'Range_winbyRuns': data_range},
    'win_by_wickets': {'Min_winwickets': np.min}
               }

In [172]:
grouped.agg(aggregations)

                    season   win_by_runs                 win_by_wickets
               Season_Mean Max_winbyruns Range_winbyRuns Min_winwickets
toss_decision
bat            2011.798535           111             111              0
field          2013.011019           146             146              0

In [173]:
matches.groupby(['toss_decision', 'result']).season.mean().unstack()

result         no result       normal          tie
toss_decision
bat               2011.0  2011.769517  2014.666667
field             2015.0  2013.014006  2011.750000

In [174]:
matches.head(3)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,05/04/17,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,06/04/17,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN
2,3,2017,Rajkot,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN

---

### CONCATENATIONS AND DROPPING

In [175]:
brics

                CAPITAL    AREA  POPULATION
COUNTRY
Brazil         Brasilia   8.516      200.40
Russia           Moscow  17.100      143.50
India         New Delhi   3.286     1252.00
China           Beijing   9.597     1357.00
South Africa   Pretoria   1.221       52.98

In [176]:
brics.reset_index(inplace=True)

In [177]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [178]:
dict1 = {
"country":["Brazil", "Russia", "India", "China", "South Africa"],
"capital":["Brasilia", "Moscow", "New Delhi", "Beijing", "Pretoria"],
"area":[8.516, 17.10, 3.286, 9.597,1.221],
"population":[200.4, 143.5, 1252, 1357,52.98] }

In [179]:
df = pd.DataFrame(dict1)

In [180]:
df.columns = brics.columns

In [181]:
brics.append(df)

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [182]:
pd.concat([brics, df], axis = 0) #row wise

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [183]:
pd.concat([brics, df], axis = 1) #col wise

,COUNTRY,CAPITAL,AREA,POPULATION,COUNTRY,CAPITAL,AREA,POPULATION
0,Brazil,Brasilia,8.516,200.40,Brazil,Brasilia,8.516,200.40
1,Russia,Moscow,17.100,143.50,Russia,Moscow,17.100,143.50
2,India,New Delhi,3.286,1252.00,India,New Delhi,3.286,1252.00
3,China,Beijing,9.597,1357.00,China,Beijing,9.597,1357.00
4,South Africa,Pretoria,1.221,52.98,South Africa,Pretoria,1.221,52.98

In [184]:
#to insert a col

In [185]:
brics.insert(loc = 3, column="x", value = [1,2,3,10,12])

In [186]:
brics

        COUNTRY    CAPITAL    AREA   x  POPULATION
0        Brazil   Brasilia   8.516   1      200.40
1        Russia     Moscow  17.100   2      143.50
2         India  New Delhi   3.286   3     1252.00
3         China    Beijing   9.597  10     1357.00
4  South Africa   Pretoria   1.221  12       52.98

In [187]:
#how to merge the dfs

In [188]:
left = { 'id':[1,2,3,4,5],
         'Name': ['Alex', 'Amy', 'Allen', 'Alice', 'Ayoung'],
         'subject_id':['sub1','sub2','sub4','sub6','sub5']}

right = {'id':[1,6,3,4,5],
         'Height': [120,110,115,119,130],
         'subject_id':['sub2','sub4','sub3','sub6','sub5']}

In [189]:
left = pd.DataFrame(left)
left

   id    Name subject_id
0   1    Alex       sub1
1   2     Amy       sub2
2   3   Allen       sub4
3   4   Alice       sub6
4   5  Ayoung       sub5

In [190]:
right = pd.DataFrame(right)
right

   id  Height subject_id
0   1     120       sub2
1   6     110       sub4
2   3     115       sub3
3   4     119       sub6
4   5     130       sub5

In [191]:
pd.merge(left,right, how="inner", on = "id")

   id    Name subject_id_x  Height subject_id_y
0   1    Alex         sub1     120         sub2
1   3   Allen         sub4     115         sub3
2   4   Alice         sub6     119         sub6
3   5  Ayoung         sub5     130         sub5

In [192]:
#to drop the rows / columns

In [193]:
matches.head(2)

,id,season,city,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
0,1,2017,Hyderabad,05/04/17,Sunrisers Hyderabad,Royal Challengers Bangalore,Royal Challengers Bangalore,field,normal,0,Sunrisers Hyderabad,35,0,Yuvraj Singh,"Rajiv Gandhi International Stadium, Uppal",AY Dandekar,NJ Llong,NaN
1,2,2017,Pune,06/04/17,Mumbai Indians,Rising Pune Supergiant,Rising Pune Supergiant,field,normal,0,Rising Pune Supergiant,0,7,SPD Smith,Maharashtra Cricket Association Stadium,A Nand Kishore,S Ravi,NaN

In [194]:
matches.drop([0,1], axis = 0, inplace=True) #axis 0 to del rows and axis = 1 to del col

In [195]:
matches.drop(['city', 'season'], axis = 1, inplace = True)

In [196]:
matches.columns

Index(['id', 'date', 'team1', 'team2', 'toss_winner', 'toss_decision',
       'result', 'dl_applied', 'winner', 'win_by_runs', 'win_by_wickets',
       'player_of_match', 'venue', 'umpire1', 'umpire2', 'umpire3'],
      dtype='object')

In [197]:
import pandasql as pdsql

In [198]:
query = "select Read, Math1 from hyp where Read < 30 or Math1 > 60 ;"

In [199]:
df1 = pdsql.sqldf(query)

In [200]:
df1.head(4)

   Read  Math1
0  73.0     71
1  68.0     62
2  63.0     75
3  65.0     66

In [201]:
#how to use string fns on the character columns of a df

In [202]:
matches.head(2)

,id,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3
2,3,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN
3,4,08/04/17,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN

In [203]:
matches.player_of_match.loc[2]

'CA Lynn'

In [204]:
matches['fname'] = matches.player_of_match.str.split().str[0]
fname[:4]

NameError: name 'fname' is not defined

In [ ]:
matches.head(2)

In [ ]:
matches['toss_decision'] = matches.toss_decision.str.upper()

In [ ]:
matches.head(2)

In [ ]:
#to iterate over each row of the df

In [ ]:
for row in range(len(brics)):
    print(brics.iloc[row], "\n")

In [ ]:
for lab, row in brics.iterrows():
    print(lab)
    print()
    print(row)
    print("\n","\n")

In [205]:
brics

        COUNTRY    CAPITAL    AREA   x  POPULATION
0        Brazil   Brasilia   8.516   1      200.40
1        Russia     Moscow  17.100   2      143.50
2         India  New Delhi   3.286   3     1252.00
3         China    Beijing   9.597  10     1357.00
4  South Africa   Pretoria   1.221  12       52.98

In [207]:
brics = brics.drop(['x'], axis = 1)

In [208]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Delhi   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

In [209]:
brics['Popln_per_sqft'] = brics.POPULATION/brics.AREA

In [210]:
brics

        COUNTRY    CAPITAL    AREA  POPULATION  Popln_per_sqft
0        Brazil   Brasilia   8.516      200.40       23.532175
1        Russia     Moscow  17.100      143.50        8.391813
2         India  New Delhi   3.286     1252.00      381.010347
3         China    Beijing   9.597     1357.00      141.398354
4  South Africa   Pretoria   1.221       52.98       43.390663

In [211]:
matches.head()

,id,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3,fname
2,3,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN,CA
3,4,08/04/17,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN,GJ
4,5,08/04/17,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN,KM
5,6,09/04/17,Gujarat Lions,Sunrisers Hyderabad,Sunrisers Hyderabad,field,normal,0,Sunrisers Hyderabad,0,9,Rashid Khan,"Rajiv Gandhi International Stadium, Uppal",A Deshmukh,NJ Llong,NaN,Rashid
6,7,09/04/17,Kolkata Knight Riders,Mumbai Indians,Mumbai Indians,field,normal,0,Mumbai Indians,0,4,N Rana,Wankhede Stadium,Nitin Menon,CK Nandan,NaN,N

In [213]:
matches['toss_d'] = 'a'

In [218]:
matches.toss_decision.iloc[2][0]

'b'

In [241]:
matches.toss_decision[0]

'field'

In [246]:
matches['toss_d'] = matches.toss_decision.str[0]
#string fns can be applied only to the string objects
#if you need to apply string function to entire char col, you need to prefix str.

In [245]:
matches['toss_d'][:3]

0    field
1    field
2    field
Name: toss_d, dtype: object

In [248]:
matches['toss_d']=matches['toss_d'].str.upper()

In [249]:
matches["toss_dec"] = 'a'

In [227]:
len(matches[:5])

5

In [ ]:
matches["toss_dec"][2]

In [234]:
matches.reset_index(inplace = True)

In [237]:
matches.drop(labels = "index", axis = 1, inplace = True)

In [238]:
matches.head(3)

,id,date,team1,team2,toss_winner,toss_decision,result,dl_applied,winner,win_by_runs,win_by_wickets,player_of_match,venue,umpire1,umpire2,umpire3,fname,toss_d,toss_dec
0,3,07/04/17,Gujarat Lions,Kolkata Knight Riders,Kolkata Knight Riders,field,normal,0,Kolkata Knight Riders,0,10,CA Lynn,Saurashtra Cricket Association Stadium,Nitin Menon,CK Nandan,NaN,CA,F,a
1,4,08/04/17,Rising Pune Supergiant,Kings XI Punjab,Kings XI Punjab,field,normal,0,Kings XI Punjab,0,6,GJ Maxwell,Holkar Cricket Stadium,AK Chaudhary,C Shamshuddin,NaN,GJ,F,a
2,5,08/04/17,Royal Challengers Bangalore,Delhi Daredevils,Royal Challengers Bangalore,bat,normal,0,Royal Challengers Bangalore,15,0,KM Jadhav,M Chinnaswamy Stadium,NaN,NaN,NaN,KM,B,a

In [250]:
for i in range(len(matches[:5])):
    matches["toss_dec"][i] = matches.toss_decision[i].upper()

In [252]:
matches['toss_dec'][:10]

0    FIELD
1    FIELD
2      BAT
3    FIELD
4    FIELD
5        a
6        a
7        a
8        a
9        a
Name: toss_dec, dtype: object

In [256]:
matches[4:7]['toss_winner']

4                 Mumbai Indians
5    Royal Challengers Bangalore
6         Rising Pune Supergiant
Name: toss_winner, dtype: object

In [259]:
matches['match_opponents'] = matches['team1']+" vs " + matches["team2"]

In [261]:
matches.match_opponents[:4]

0             Gujarat Lions vs Kolkata Knight Riders
1          Rising Pune Supergiant vs Kings XI Punjab
2    Royal Challengers Bangalore vs Delhi Daredevils
3               Gujarat Lions vs Sunrisers Hyderabad
Name: match_opponents, dtype: object

In [ ]:
#apply function - to apply a function on each component of the series

In [262]:
brics.COUNTRY

0          Brazil
1          Russia
2           India
3           China
4    South Africa
Name: COUNTRY, dtype: object

In [265]:
brics["length_country"] = brics.COUNTRY.apply(len)

In [266]:
brics

,COUNTRY,CAPITAL,AREA,POPULATION,Popln_per_sqft,length_country,length country
0,Brazil,Brasilia,8.516,200.40,23.532175,6,6
1,Russia,Moscow,17.100,143.50,8.391813,6,6
2,India,New Delhi,3.286,1252.00,381.010347,5,5
3,China,Beijing,9.597,1357.00,141.398354,5,5
4,South Africa,Pretoria,1.221,52.98,43.390663,12,12

In [267]:
brics.length_country

0     6
1     6
2     5
3     5
4    12
Name: length_country, dtype: int64

In [268]:
s = pd.Series([20,40,60])

In [271]:
log_s = s.apply(np.log)
log_s

0    2.995732
1    3.688879
2    4.094345
dtype: float64

In [272]:
len(brics)

5

In [273]:
len("how")

3

In [274]:
len(np.array([[1,2], [3,4]]))

2

In [275]:
len([1,3,5])

3

In [284]:
def printdictionary(*args, **kwargs):
    #*args indicates as many number of arguments as you want
    #**kwargs indicates the dictionary of arguments and their values
    print(kwargs)
    for key in kwargs:
        print(key, kwargs[key])

In [285]:
printdictionary(a = 5, b = 10, c = 20, why = "Samridhi")

{'a': 5, 'b': 10, 'c': 20, 'why': 'Samridhi'}
a 5
b 10
c 20
why Samridhi

In [276]:
def add_custom_values(x, *args, **kwargs): 
    for month in kwargs:
        x+=kwargs[month]
    return x

In [279]:
add_custom_values(20, jan = 1, feb = 2)

23

In [287]:
s = pd.Series([20,21,12], index = ["London", "NewYork", "California"])
s.apply(add_custom_values, june = 0, july = 1, aug = 2, a = 12)

London        35
NewYork       36
California    27
dtype: int64

In [289]:
#to remove duplicate rows
matches = matches.drop_duplicates()

In [294]:
#to sort the rows of a df
matches.sort_values(by = ['team1','win_by_runs'], ascending = False, inplace = True)

In [296]:
brics.to_csv(r"C:\Users\Vaibhav\Desktop\brics.csv")

---

In [297]:
data = {'raw': ['Arizona 1 2014-12-23       3242.0',
                'Iowa 1 2010-02-23       3453.7',
                'Oregon 0 2014-06-20       2123.0',
                'Maryland 0 2014-03-14       1123.6',
                'Florida 1 2013-01-15       2134.0',
                'Georgia 0 2012-07-14       2345.6']}

In [299]:
df = pd.DataFrame(data)
df

                                  raw
0   Arizona 1 2014-12-23       3242.0
1      Iowa 1 2010-02-23       3453.7
2    Oregon 0 2014-06-20       2123.0
3  Maryland 0 2014-03-14       1123.6
4   Florida 1 2013-01-15       2134.0
5   Georgia 0 2012-07-14       2345.6

In [300]:
import re

In [ ]:
#to find out all the single digits

In [303]:
a = df.iloc[0][0]
a

'Arizona 1 2014-12-23       3242.0'

In [307]:
p = re.search("(\d)", a)
p.group()

'1'

In [310]:
df['female'] = df["raw"].str.extract("(\d)", expand = True)#expand = True gives df and expand = False gives series
df.female

0    1
1    1
2    0
3    0
4    1
5    0
Name: female, dtype: object

In [314]:
df["date"] = df["raw"].str.extract("(\d\d\d\d-..-..)", expand = True)
df.date

0    2014-12-23
1    2010-02-23
2    2014-06-20
3    2014-03-14
4    2013-01-15
5    2012-07-14
Name: date, dtype: object

In [317]:
df["score"]=df['raw'].str.extract("(\d\d\d\d\.\d)", expand = True)

In [323]:
df["raw"].str.extract("([A-Z]\w{1,})", expand = True)

          0
0   Arizona
1      Iowa
2    Oregon
3  Maryland
4   Florida
5   Georgia